{
	"introduction": "Over the course of the fall term, between October 3rd and December 24th, 2021, I had the wonderful opportunity to work as a web developer at Kenna. This report holds more information about the development and learning experiences. I’ve also incorporated aspects of what I’ve learned to the development of this website. ",
	"employerInfo": "Kenna is a marketing solutions company, developing many kinds of applications with customer first thinking with the main office located in Mississauga. Kenna is a company partner under Stagwell Inc. which is one of the largest global marketing companies. Kenna primarily sells marketing solutions to North American customers and the major customer Kenna is working with an agrochemical company, BASF for their “Invigor” product line. Kenna has a wide variety of teams that help build solutions including marketing research, graphic design, web development and many more. Kenna focuses on the needs of customers so some of those needs can possibly be analytics software, product management tools, marketing campaign projects. These all fall under the category of “marketing solutions”.",
	"goals": [
		"I had 3 primary learning goals. The first learning goals was to learn approaches to analyze problems and explore and narrow plausible solutions for the best fit of the application. The second was to develop professional integrative communication skill to increase transparency and transparency between my team. Finally, the third learning goal was to be exposed to and work with corporate level technology and to contribute to my team as much as I can while simultaneously developing my skills as a web application developer. ",
		"As I worked further into my co-op term, I found many technical challenges and experiences that helped me reach my goals. Regarding the first goal, I had to debug application problems that was raised. I learned different approaches to diagnose problems in the APIs that I developed with technologies like Postman and was able to track bug histories through going through SQL logs. In the end, I’ve gotten much better at diagnosing problems for RESTful APIs for the back end and React on the front-end which will all be useful skills in my future job search as those skills and technologies are not only very popular but would help me produce better and more efficient code the future.",
		"I believe I was not successful to complete my second goal. I had joined Kenna for my work term a month late, thus I was not able to join the initial fall semester orientation where I could be introduced to my team. My co-op term mainly consisted of relatively frequent communication between my supervisor or the specific project lead and therefore, I did not participate much in stand-up meetings and communicate between other teams. While my goal for increasing my communication skills was not full successful, I had some communication between others with Jira which was very useful to learn how project progress was kept track of and exposed me to agile development. Knowing how to communicate through Teams, use version control with Bitbucket and take part of the software development lifecycle with Jira is not only a successful step to becoming a communicative software engineer, but it will serve as knowledge that is very demanded by prospective jobs in the jobs.",
		"Finally, my most fruitful goal was to become more proficient with the technologies used at Kenna. In my front-end learning experience of my full-stack journey, I realized I did not learn CSS as well and therefore I eagerly moved towards learning React.js. This left my CSS skills to be very weak and left me to be more dreadful when looking at web styling tasks. However, as I was exposed to front-end development with jQuery and React.js when developing websites for marketing campaigns, I learned proper development such as using flexbox and CSS grid which made positioning much easier. In addition, I learned more complex usage of margins which helped me create more accessible UI with a better UX in our applications. Furthermore, I’ve built and optimized RESTful APIs with Node.js and Express.js working closely with Microsoft SQL Server creating stored procedures. Kenna provided workshops to help create optimized queries and I’ve taken the most out of that to help yield better results for the projects I developed. Ultimately, all these technologies and skills has helped me gain a better understanding of what it means to be a full-stack engineer and with quantifiable results along with the skills I developed, it will help me with my future projects, co-op search and jobs as these technologies are demanded for."
	],
	"jobDescription": "As a marketing solutions company, deadlines for projects come very quickly and frequently. Given this, I have worked on 4 main projects. The first project was a few UI changes for one of BASF’s marketing websites where I had to use jQuery to help interact and make changes with the DOM. I had to translate newly designed high-fidelity wireframes into tangible results, and I made some UI choices in design that helped improve the overall UX experience. The second project was developing front-end React.js components for a marketing campaign project. I was able to produce clean and accessible code in this circumstance. The third and most interesting project was developing the API for the back-end server for product management tools where I had to make endpoints and connect the server with the SQL stored procedures to collect and send appropriate data. By developing these API’s, I was able to make the application more responsive and increase the performance of data processing and collection. The fourth and final task was to create a front-end table that had a more complex control flow with the Lotus notes legacy software. \nUltimately, most of the skills I used for this job was something I had to learn by myself through extra-curriculum, personal projects, and past experiences. jQuery was something I had no familiarity with for example, so I had to learn that on the job and many of the technologies or approaches I was not familiar with was eventually learnt by analyzing the codebase and previous solutions or through the internet. ",
	"conclusion": "Overall, this co-op experience was a valuable learning, development, and contribution experience. In the end, I have realized that I’ll need more confidence when it comes to communication. I have learned many new technologies and software engineering concepts. And in the end, I am truly grateful to have an opportunity to have made positive impacts and meaningful contributions at Kenna.",
	"acknowledgements": "I would like to extend my gratitude my supervisor Kishan Wijeswarante as he has been a wonderful mentor who has been a crucial part of my learning experience at Kenna and I would like to thank him for his time and effort. I would also like to extend my gratitude towards my parents and family for all the love and support beyond my comprehension which I am truly grateful for. I would also like to give my genuine gratitude to Amira Bouchema for the support regardless of the position I am in which has made such a huge positive impact. And finally, I would like to acknowledge some of my best friends: Fardin Siddiqui, Faraj Mustafa, Shaiza Hashmi, Rithik Choudhary, Ibrahim Rather, Lavan Raveendrakumar, Mariya Patel, Jawad Khan, and Shari Law for the care and support they give. "
}
